[
  {
    "term": "Active learning",
    "definition": "a training approach in which the algorithm chooses some of the data it learns from. active learning is valuable when labeled examples are scarce or expensive. an active learning algorithm selectively seeks the examples it needs for learning.",
    "source": "Google machine learning glossary",
    "letter": "A"
  },
  {
    "term": "Agent",
    "definition": "software that can reason about multimodal user inputs in order to plan and execute actions on behalf of the user. in reinforcement learning, an agent is the entity that uses a policy to maximize expected return when transitioning between states of the environment.",
    "source": "Google machine learning glossary",
    "letter": "A"
  },
  {
    "term": "Base model",
    "definition": "a pre-trained model that can serve as the starting point for fine-tuning to address specific tasks or applications.",
    "source": "Google machine learning glossary",
    "letter": "B"
  },
  {
    "term": "BERT (Bidirectional Encoder Representations from Transformers)",
    "definition": "a model architecture for text representation. a trained bert model can act as part of a larger model for text classification or other ml tasks. bert relies on self-attention, uses the encoder part of the transformer, is bidirectional, and uses masking for unsupervised training. variants include albert and labse.",
    "source": "Google machine learning glossary",
    "letter": "B"
  },
  {
    "term": "Bias (ethics/fairness)",
    "definition": "stereotyping, prejudice or favoritism towards some things, people, or groups over others. these biases can affect data collection, system design, and user interaction. another meaning is systematic error introduced by sampling or reporting procedures. not to be confused with the bias term in machine learning models or prediction bias.",
    "source": "Google machine learning glossary",
    "letter": "B"
  },
  {
    "term": "Black box model",
    "definition": "a model whose reasoning is difficult or impossible for humans to understand. humans can observe input and output but not the internal process. most deep models and large language models are considered black boxes.",
    "source": "Google machine learning glossary",
    "letter": "B"
  },
  {
    "term": "Chat",
    "definition": "the contents of a back-and-forth dialogue with an ml system, typically a large language model. previous interactions form the context for subsequent exchanges. a chatbot is an application of a large language model.",
    "source": "Google machine learning glossary",
    "letter": "C"
  },
  {
    "term": "Contextualized language embedding",
    "definition": "an embedding that captures syntax, semantics, and context. for example, unlike older embeddings, contextualized embeddings recognize that cow can sometimes mean either cow or bull.",
    "source": "Google machine learning glossary",
    "letter": "C"
  },
  {
    "term": "Data analysis",
    "definition": "obtaining an understanding of data by considering samples, measurement, and visualization. data analysis is useful when a dataset is first received and also in understanding experiments and debugging problems.",
    "source": "Google machine learning glossary",
    "letter": "D"
  },
  {
    "term": "Deep model",
    "definition": "a neural network containing more than one hidden layer. also called a deep neural network. contrast with wide model.",
    "source": "Google machine learning glossary",
    "letter": "D"
  },
  {
    "term": "Foundation model",
    "definition": "a very large pre-trained model trained on a diverse dataset. a foundation model responds well to a wide range of requests and can serve as a base model for customization.",
    "source": "Google machine learning glossary",
    "letter": "F"
  },
  {
    "term": "Generative AI",
    "definition": "a field in which models create complex, coherent, and original content such as text, images, audio, or video. earlier technologies like lstms and rnns can generate content but generative ai is usually associated with large, multimodal models.",
    "source": "Google machine learning glossary",
    "letter": "G"
  },
  {
    "term": "Generative model",
    "definition": "a model that creates new examples from a training dataset or determines the probability that a new example comes from the same distribution as the training set.",
    "source": "Google machine learning glossary",
    "letter": "G"
  },
  {
    "term": "GPT (Generative Pre-trained Transformer)",
    "definition": "a family of transformer-based large language models developed by openai. gpt variants can apply to multiple modalities including text and image generation.",
    "source": "Google machine learning glossary",
    "letter": "G"
  },
  {
    "term": "Hallucination",
    "definition": "the production of plausible but factually incorrect output by a generative ai model. for example, a model that claims barack obama died in 1865 is hallucinating.",
    "source": "Google machine learning glossary",
    "letter": "H"
  },
  {
    "term": "Heuristic",
    "definition": "a simple and quickly implemented solution to a problem. heuristics can provide acceptable accuracy but are usually less powerful than deep learning methods.",
    "source": "Google machine learning glossary",
    "letter": "H"
  },
  {
    "term": "Historical bias",
    "definition": "a type of bias that already exists in the world and appears in datasets. historical bias reflects stereotypes, inequalities, and prejudices in training data.",
    "source": "Google machine learning glossary",
    "letter": "H"
  },
  {
    "term": "Implicit bias",
    "definition": "automatic associations or assumptions based on mind models and memories. implicit bias can affect data collection, classification, and system design.",
    "source": "Google machine learning glossary",
    "letter": "I"
  },
  {
    "term": "Inference",
    "definition": "the process of making predictions by applying a trained model to new examples. in large language models, inference is generating a response to an input prompt.",
    "source": "Google machine learning glossary",
    "letter": "I"
  },
  {
    "term": "Large language model",
    "definition": "a language model with a very high number of parameters, usually transformer-based, such as gemini or gpt.",
    "source": "Google machine learning glossary",
    "letter": "L"
  },
  {
    "term": "Machine learning",
    "definition": "a program or system that trains a model from input data so the model can make predictions from new data. machine learning also refers to the field of study concerned with these systems.",
    "source": "Google machine learning glossary",
    "letter": "M"
  },
  {
    "term": "Natural language processing",
    "definition": "the field of teaching computers to process human language using linguistic rules. modern nlp largely relies on machine learning.",
    "source": "Google machine learning glossary",
    "letter": "N"
  },
  {
    "term": "Natural language understanding",
    "definition": "a subset of nlp that determines the intentions behind something said or typed. nlu can consider complex aspects like context, sarcasm, and sentiment.",
    "source": "Google machine learning glossary",
    "letter": "N"
  },
  {
    "term": "Neural network",
    "definition": "a model containing at least one hidden layer. deep neural networks contain more than one hidden layer. neural networks can model complex nonlinear relationships between features and labels.",
    "source": "Google machine learning glossary",
    "letter": "N"
  },
  {
    "term": "Post-trained model",
    "definition": "a loosely-defined term referring to a pre-trained model that has gone through post-processing such as distillation, fine-tuning, or instruction tuning.",
    "source": "Google machine learning glossary",
    "letter": "P"
  },
  {
    "term": "Pre-trained model",
    "definition": "a trained model, now typically referring to large language models or other generative ai systems that can be fine-tuned for specific tasks.",
    "source": "Google machine learning glossary",
    "letter": "P"
  },
  {
    "term": "Pre-training",
    "definition": "the initial training of a model on a large dataset. pre-training produces a general model that can be refined through techniques such as distillation or fine-tuning.",
    "source": "Google machine learning glossary",
    "letter": "P"
  },
  {
    "term": "Retrieval-augmented generation (RAG)",
    "definition": "a technique for improving the quality of large language model output by grounding it with knowledge retrieved after training. rag increases factual accuracy and enables citation of sources.",
    "source": "Google machine learning glossary",
    "letter": "R"
  },
  {
    "term": "Selection bias",
    "definition": "errors in conclusions caused by a selection process that generates systematic differences between samples observed and not observed in data. forms include coverage bias, sampling bias, and non-response bias.",
    "source": "Google machine learning glossary",
    "letter": "S"
  },
  {
    "term": "Self-supervised learning",
    "definition": "a family of techniques for converting an unsupervised ml problem into a supervised one by creating surrogate labels from unlabeled data. transformers such as bert use self-supervised learning.",
    "source": "Google machine learning glossary",
    "letter": "S"
  },
  {
    "term": "Self-training",
    "definition": "a variant of self-supervised learning useful when there are far more unlabeled than labeled examples. self-training iteratively trains on labeled examples and then adds confident predictions on unlabeled data.",
    "source": "Google machine learning glossary",
    "letter": "S"
  },
  {
    "term": "Semi-supervised learning",
    "definition": "training a model on data where some examples are labeled and others are not. semi-supervised learning is useful when labels are expensive but unlabeled examples are plentiful.",
    "source": "Google machine learning glossary",
    "letter": "S"
  },
  {
    "term": "Token",
    "definition": "the atomic unit that a language model trains on and predicts. tokens can be words, characters, or subwords. in other domains tokens may represent other atomic units such as image patches.",
    "source": "Google machine learning glossary",
    "letter": "T"
  },
  {
    "term": "Tokenizer",
    "definition": "a system or algorithm that translates input data into tokens. tokenizers for multimodal systems must translate each input type into a unified embedding space.",
    "source": "Google machine learning glossary",
    "letter": "T"
  },
  {
    "term": "Transformer",
    "definition": "a neural network architecture that relies on self-attention to transform sequences of embeddings. transformers may include encoders, decoders, or both, and are the basis of most large language models.",
    "source": "Google machine learning glossary",
    "letter": "T"
  },
  {
    "term": "Validation",
    "definition": "the initial evaluation of a model's quality against a validation set. validation helps guard against overfitting and acts as a first round of testing before evaluation on a test set.",
    "source": "Google machine learning glossary",
    "letter": "V"
  },
  {
    "term": "Algorithm",
    "definition": "a sequence of rules that a computer follows to complete a task — it takes an input, for example, from a data set, then performs a test or calculation on it and generates an output. algorithms can be used in this way to spot patterns in data and make predictions.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "A"
  },
  {
    "term": "Algorithmic bias",
    "definition": "decision-making errors or unfair outcomes that can arise from problems with an algorithm’s processing of data, or flaws and biases in the underlying data itself. a bias can result in an algorithm inadvertently privileging or disadvantaging one group of users over another group. examples include customers being treated differently because of systemic prejudices around race, gender, sexuality, disability, or ethnicity.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "A"
  },
  {
    "term": "Alignment",
    "definition": "an area of research responsible for ensuring that artificial general intelligence — or so-called god-like ai — systems have goals that align with human values. for example, alignment researchers have helped to train ai models to avoid answering questions about how to self-harm and how to use bigoted language.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "A"
  },
  {
    "term": "Artificial general intelligence",
    "definition": "a computer system capable of generating new scientific knowledge and performing any task that humans can. it would enable the creation of a superintelligent computer that learns and develops autonomously, understands its environment without the need for supervision, and becomes capable of transforming the world around it.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "A"
  },
  {
    "term": "Artificial intelligence (AI)",
    "definition": "the science of enabling machines to perform tasks that would previously have required human brainpower — for example, reasoning, decision-making, differentiating words and images; learning from mistakes, predicting outcomes, problem solving. it involves the use of computers to reproduce or undertake such actions, often at a higher speed and accuracy than previously achieved.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "A"
  },
  {
    "term": "Big data",
    "definition": "very large data sets that may be analysed computationally to reveal patterns, trends, and associations. businesses may use analysis of big data to identify common human behaviours, transactions, and interactions.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "B"
  },
  {
    "term": "Chatbot",
    "definition": "a software application that can respond to text questions and mimic human conversation, by analysing text and predicting the answer that is required. chatbots are mostly used as virtual assistants on customer service websites, but generative ai has enabled them to be used to create different forms of writing.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "C"
  },
  {
    "term": "ChatGPT",
    "definition": "a natural language processing chatbot driven by ai technology developed by openai. chatgpt is based on a language-based model that the developer fine tunes with help from user feedback. in response to text-based questions and prompts describing the type of written output required, the chatbot can compose articles and essays, write emails, tell creative stories, and generate programming code.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "C"
  },
  {
    "term": "Compute",
    "definition": "the computational power required for ai systems to perform tasks, such as processing data, training machine learning models, and making predictions — measured in floating-point operations per second, or flops.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "C"
  },
  {
    "term": "Computer vision",
    "definition": "a field of research that uses computers to obtain useful information from digital images or videos. applications include object recognition; facial recognition; medical imaging; navigation; video surveillance. it uses machine learning models that can analyse and distinguish different images based on their attributes.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "C"
  },
  {
    "term": "Dall-E",
    "definition": "a deep-learning model developed by openai that can generate digital images from text-based natural language descriptions, called prompts, which are input by users.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "D"
  },
  {
    "term": "Data science",
    "definition": "research involving the processing of large amounts of data in order to identify patterns, spot trends and outliers, and provide insights into real-world problems.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "D"
  },
  {
    "term": "Deepfake",
    "definition": "synthetic audio, video or imagery that can convincingly represent a real person, or create a realistic impression of a person who has never existed. created by machine learning algorithms, deepfakes can make real people appear to say and do whatever the creators wish.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "D"
  },
  {
    "term": "Deep learning (DL)",
    "definition": "a subset of machine learning that can be used to solve complex problems, such as speech recognition or image classification. unlike machine learning, which requires human input to understand the data and learn from it, dl can ingest unstructured data in a raw form — from text, music or video — and distinguish the difference between different categories of data. dl models run on software called neural networks, modelled on the human brain.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "D"
  },
  {
    "term": "Floating-point operations per second (FLOPS)",
    "definition": "the unit of measurement used to calculate the power of a supercomputer.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "F"
  },
  {
    "term": "Generative AI",
    "definition": "a subset of machine learning models that can generate media, such as writing, images or music. generative ai is trained on vast amounts of raw data — for example, the text of millions of web pages or books — and learns the patterns within it, in order to generate the most likely correct response when prompted with a question written in text in that language.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "G"
  },
  {
    "term": "Generative adversarial network (GAN)",
    "definition": "a machine learning technique that can generate data, such as realistic deepfake images, that is difficult to distinguish from the data it is trained on. a gan is made up of two competing elements: a generator and a discriminator. the generator creates fake data, which the discriminator compares to real training data and feeds back with where it has detected differences.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "G"
  },
  {
    "term": "Generative pre-trained transformer (GPT)",
    "definition": "one family of large language models developed by openai since 2018, and used to power its chatgpt chatbot.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "G"
  },
  {
    "term": "God-like AI",
    "definition": "a popular term for artificial general intelligence.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "G"
  },
  {
    "term": "Hallucination",
    "definition": "a flaw in generative ai models that can result in chatbots stating falsehoods as facts, or inventing realities. examples of hallucinations include creating fake book citations or answering elephant when asked which mammal lays the largest eggs.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "H"
  },
  {
    "term": "Human in the loop (HITL)",
    "definition": "a system comprising a human and an ai component, in which the human can intervene by training, tuning or testing the system’s algorithm, so that it produces more useful results.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "H"
  },
  {
    "term": "Large language model (LLM)",
    "definition": "a machine learning algorithm that can recognise, summarise, translate, predict and generate text.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "L"
  },
  {
    "term": "Machine learning (ML)",
    "definition": "an application of ai whereby computer programs can automatically learn from, and adapt to, new data without being specifically programmed to do so. ml programs improve over time with training, learning from past experiences or mistakes, as well as spotting patterns in new data.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "M"
  },
  {
    "term": "Multi-agent system",
    "definition": "a computer system involving multiple, interacting software programs known as agents. agents often actively help and work with humans to complete a task — the most common everyday examples are virtual assistants on smartphones and personal computers such as apple’s siri, amazon’s alexa and microsoft’s cortana.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "M"
  },
  {
    "term": "Natural language processing (NLP)",
    "definition": "a field of ai that uses computer algorithms to analyse or synthesise human speech and text. the algorithms look for linguistic patterns in how sentences and paragraphs are constructed, and how the words, context and structure work together to create meaning.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "N"
  },
  {
    "term": "Neural networks",
    "definition": "computer systems for processing data inspired by the way neurons interact in the human brain. data goes into the system, the neurons communicate to understand it, and the system creates an output. the more frequently the system acts on data, the better able it is to discern differences in the data set.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "N"
  },
  {
    "term": "Open source",
    "definition": "software and data that are free to edit and share, in order to help researchers to collaborate, to check and replicate findings, and to share new developments with the wider community of developers.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "O"
  },
  {
    "term": "Singularity",
    "definition": "a currently hypothetical point in time when artificial general intelligence surpasses human intelligence, leading to an acceleration in technological progress and the potential automation of all knowledge-based work.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "S"
  },
  {
    "term": "Superintelligence",
    "definition": "an ai system that is self-aware and possesses a higher level of intelligence than humans.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "S"
  },
  {
    "term": "Supervised learning",
    "definition": "a form of machine learning that uses labelled data to train an algorithm to classify data or predict outcomes accurately. because the inputs are labelled, the model can measure its accuracy in recognising or distinguishing between them, and therefore learn over time.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "S"
  },
  {
    "term": "Turing test",
    "definition": "a test of a machine’s ability to demonstrate humanlike intelligence. it was first devised by mathematician and computing pioneer alan turing as the imitation game in his 1950 paper computing machinery and intelligence. the test involves a human evaluator asking questions to another human and to a machine via a computer keyboard and monitor. if the evaluator cannot tell from the written responses which is the human and which is the machine, then the machine has passed the turing test.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "T"
  },
  {
    "term": "Unsupervised learning",
    "definition": "a form of machine learning in which algorithms analyse and cluster unlabeled data sets, by looking for hidden patterns in the data — without the need for human intervention to train or correct them.",
    "source": "The Alan Turing Institute Data Science and AI Glossary",
    "letter": "U"
  }
]